question_list = [
    {
        "question": "В каком году началась вторая мировая война?",
        "options": ["A) 1939 г.", "B) 1941 г.", "C) 1931 г.", "D) 1945 г."],
        "correct_option": "A"
    },
    {
        "question": "Когда вышел Айфон 12?",
        "options": ["A) 1 января 2021", "B) 9 декабря 2020", "C) 13 октября 2020", "D) 21 июля 2022"],
        "correct_option": "C"
    },
    {
        "question": "Сколько денег собрал фильм Титаник?",
        "options": ["A) $2 264 743 305", "B) $200 000 000", "C) $25 529 945", "D) $1 590 450 697"],
        "correct_option": "A"
    },
    {
        "question": "Сколько простых чисел от 1 до 100?",
        "options": ["A) 11", "B) 25", "C) 100", "D) 24"],
        "correct_option": "B"
    },
    {
        "question": "Когда состоялся референдум вхождения ДНР И ЛНР в состав РФ?",
        "options": ["A)22 октября 2022", "B) 5 июля 2022", "C) 24 февраля 2022", "D) 30 сентября 2022"],
        "correct_option": "D"
    }
]

option_list = ["A", "B", "C", "D"]